// 1. Вивести на екран всі числа від 1 до 10 за допомогою циклу while.
const maxNumber = 10;
let i = 1;
while (i <= maxNumber) {
    console.log(i);
    i++;
}

// 2. Вивести на екран всі парні числа від 2 до 20 за допомогою циклу for.
// Якщо число не парне, пропустити його за допомогою continue.
const upperLimit = 20;
for (let j = 2; j <= upperLimit; j++) {
    if (j % 2 !== 0) continue;
    console.log(j);
}

// 3. Вивести на екран таблицю множення числа 7 за допомогою циклу for.
const number = 7;
for (let k = 1; k <= 10; k++) {
    console.log(`${number} x ${k} = ${number * k}`);
}

// 4. Створити масив з числами від 1 до 5.
// Вивести на екран кожен елемент масиву за допомогою циклу while.
const array1 = [1, 2, 3, 4, 5];
let index = 0;
while (index < array1.length) {
    console.log(array1[index]);
    index++;
}

// 5. Створити масив із числами від 1 до 10.
// За допомогою циклу for пройтися по масиву та вивести на екран всі числа, крім числа 7.
// Якщо зустрінете число 7, закінчити виконання циклу за допомогою оператора break.
const array2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10];
for (let num of array2) {
    if (num === 7) break;
    console.log(num);
}

// 6. Створити скрипт, який виводить на екран всі числа, які менші за n.
// Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.
const n = 8; // Значення n
for (let m = 1; m < 20; m++) {
    if (m >= n) break;
    console.log(m);
}

// 7. За допомогою циклу while вивести на екран всі числа від 1 до 20, крім чисел, кратних 3.
// Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
let p = 1;
while (p <= 20) {
    if (p % 3 === 0) {
        p++;
        continue;
    }
    console.log(p);
    p++;
}
